---
kind: other
id: Methods.T:Autodesk.Revit.DB.MathComparisonUtils
source: html/538d24c8-c326-945f-29f0-fef4565ef9f8.htm
---
# MathComparisonUtils Methods

Checks if two doubles are almost equal, using the internal tolerance.